pip.org
#+TITLE: Pip Loom: DotCortex
#+DESCRIPTION: Python pip and pipx manifests
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Pip manifest
User-level pip packages (not conda-managed). One package per line.
Leave VERSION empty to install latest.

#+BEGIN_SRC text :tangle all/.pip/manifest/packages.ssv
# ~/DotCortex/all/.pip/manifest/packages.ssv
# PKG VERSION EXTRA
# Captured from T480s 2026-03-15
litellm "" ""
openai "" ""
huggingface_hub "" ""
tiktoken "" ""
tokenizers "" ""
fastapi "" ""
uvicorn "" ""
typer "" ""
pydantic "" ""
pydantic-settings "" ""
rich "" ""
httpx "" ""
python-dotenv "" ""
perplexity-web-mcp-cli "" ""
gemini-cli-usage "" ""
semver "" ""
readchar "" ""
shellingham "" ""
git-filter-repo "" ""
piper-tts "" ""
antigravity_decryptor "" "git+https://github.com/arashz/antigravity_decryptor"
#+END_SRC

* Capture current pip → manifest
#+BEGIN_SRC bash :tangle all/.local/bin/pip-capture :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/pip-capture
set -euo pipefail

MAN="$HOME/DotCortex/all/.pip/manifest/packages.ssv"

mkdir -p "$(dirname "$MAN")"
touch "$MAN"

tmp_existing="$(mktemp)"
tmp_have="$(mktemp)"
tmp_new="$(mktemp)"

# Already tracked
awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_existing"

# Currently installed (user + system, skip pip/setuptools/wheel)
python3 -m pip list --format=freeze 2>/dev/null \
  | awk -F== '{ print $1 }' \
  | grep -vEi '^(pip|setuptools|wheel|pkg.resources)$' \
  | sort -u >"$tmp_have"

# new = have - existing
comm -13 "$tmp_existing" "$tmp_have" >"$tmp_new"

rm -f "$tmp_existing" "$tmp_have"

if [ ! -s "$tmp_new" ]; then
  rm -f "$tmp_new"
  echo "No new pip packages to capture into $MAN"
  exit 0
fi

while read -r pkg; do
  [ -n "$pkg" ] || continue
  printf '%s "" ""\n' "$pkg" >>"$MAN"
done <"$tmp_new"

rm -f "$tmp_new"
echo "Updated $MAN"
#+END_SRC

* Plan diff
#+BEGIN_SRC bash :tangle all/.local/bin/pip-diff :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/pip-diff
set -euo pipefail

MAN="$HOME/DotCortex/all/.pip/manifest/packages.ssv"

tmp_want="$(mktemp)"
tmp_have="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_want"

python3 -m pip list --format=freeze 2>/dev/null \
  | awk -F== '{ print $1 }' \
  | sort -u >"$tmp_have"

echo "== pip plan =="
echo "[to install]"
comm -23 "$tmp_want" "$tmp_have" | sed 's/^/  + /'

echo "[extra - not in manifest]"
comm -13 "$tmp_want" "$tmp_have" \
  | grep -vEi '^(pip|setuptools|wheel|pkg.resources)$' \
  | sed 's/^/  - /'

rm -f "$tmp_want" "$tmp_have"
#+END_SRC

* Apply manifest
#+BEGIN_SRC bash :tangle all/.local/bin/pip-apply :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/pip-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.pip/manifest/packages.ssv"
SRC_CACHE="${XDG_CACHE_HOME:-$HOME/.cache}/pip-src"

echo "== pip apply =="

# Bootstrap Guix pip if broken (24.x has resolvelib bug)
GUIX_PYTHON="$HOME/.guix-extra-profiles/core/core/bin/python3"
if [ -x "$GUIX_PYTHON" ]; then
  GUIX_PIP_VER=$("$GUIX_PYTHON" -m pip --version 2>/dev/null | awk '{print $2}' || echo "0")
  GUIX_PIP_MAJOR=$(echo "$GUIX_PIP_VER" | cut -d. -f1)
  if [ "${GUIX_PIP_MAJOR:-0}" -lt 25 ] 2>/dev/null; then
    echo "  bootstrapping pip (Guix pip $GUIX_PIP_VER is broken)..."
    curl -sS https://bootstrap.pypa.io/get-pip.py | "$GUIX_PYTHON" - --user \
      && echo "  pip bootstrapped to 26+" \
      || echo "  WARNING: get-pip.py failed"
  fi
fi

while IFS= read -r line; do
  # Skip comments and blanks
  [[ "$line" =~ ^[[:space:]]*# ]] && continue
  [[ -z "${line// /}" ]] && continue

  pkg="$(echo "$line" | awk '{ print $1 }')"
  version="$(echo "$line" | awk '{ print $2 }' | tr -d '"')"
  extra="$(echo "$line" | awk '{ print $3 }' | tr -d '"')"

  [ -z "$pkg" ] && continue

  # Git-sourced package: clone once, pull on subsequent runs, reinstall only on update
  if [[ "$extra" == git+https://* ]] || [[ "$extra" == git+http://* ]]; then
    cache="$SRC_CACHE/$pkg"
    clone_url="${extra#git+}"
    needs_install=0

    if [ ! -d "$cache/.git" ]; then
      echo "  cloning: $pkg → $cache"
      mkdir -p "$SRC_CACHE"
      git clone "$clone_url" "$cache"
      needs_install=1
    else
      before="$(git -C "$cache" rev-parse HEAD)"
      git -C "$cache" pull --ff-only --quiet
      after="$(git -C "$cache" rev-parse HEAD)"
      if [ "$before" != "$after" ]; then
        echo "  updated: $pkg ($before → $after)"
        needs_install=1
      fi
    fi

    if [ "$needs_install" = "1" ] || ! python3 -m pip show "$pkg" &>/dev/null; then
      echo "  installing: $pkg from $cache"
      python3 -m pip install --user --break-system-packages "$cache"
    else
      echo "  ok: $pkg"
    fi
    continue
  fi

  spec="$pkg"
  [ -n "$version" ] && spec="$pkg==$version"
  [ -n "$extra" ] && spec="$extra"

  if python3 -m pip show "$pkg" &>/dev/null; then
    echo "  ok: $pkg"
  else
    echo "  installing: $spec"
    python3 -m pip install --user --break-system-packages "$spec"
  fi
done <"$MAN"

echo "Done."
#+END_SRC

* Health
#+BEGIN_SRC bash :tangle all/.local/bin/pip-health :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/pip-health
set -euo pipefail

echo "PYTHON    = $(command -v python3 || echo missing)"
echo "PIP       = $(command -v pip3 || echo missing)"
echo "python ver= $(python3 --version 2>/dev/null || echo n/a)"
echo "pip ver   = $(python3 -m pip --version 2>/dev/null || echo n/a)"
echo ""
echo "User packages: $(python3 -m pip list --user --format=freeze 2>/dev/null | wc -l)"
echo "Total packages: $(python3 -m pip list --format=freeze 2>/dev/null | wc -l)"
#+END_SRC

* Makefile fragment for pip
#+BEGIN_SRC makefile :tangle all/.mk/pip.mk :padline no
# ~/DotCortex/all/.mk/pip.mk
.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: pip-capture pip-diff pip-sync pip-apply pip-health

pip-capture:
| @chmod +x $(HOME)/.local/bin/pip-capture 2>/dev/null || true
| $(HOME)/.local/bin/pip-capture

pip-diff:
| @chmod +x $(HOME)/.local/bin/pip-diff 2>/dev/null || true
| $(HOME)/.local/bin/pip-diff

pip-sync:
| @chmod +x $(HOME)/.local/bin/pip-apply 2>/dev/null || true
| $(HOME)/.local/bin/pip-apply

pip-apply:
| @chmod +x $(HOME)/.local/bin/pip-apply 2>/dev/null || true
| $(HOME)/.local/bin/pip-apply

pip-health:
| @chmod +x $(HOME)/.local/bin/pip-health 2>/dev/null || true
| $(HOME)/.local/bin/pip-health
#+END_SRC

* Pipx manifest
=pipx= belongs in this file too, even though the managed pipx workflow has not been
fully implemented yet. Keep pip and pipx together at the source layer while preserving
separate generated outputs and verbs once pipx automation is added.
