all/.local/bin/pip-apply
#!/usr/bin/env bash
# Apply manifest

# [[file:../../../pip.org::*Apply manifest][Apply manifest:1]]
# ~/DotCortex/all/.local/bin/pip-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.pip/manifest/packages.ssv"
SRC_CACHE="${XDG_CACHE_HOME:-$HOME/.cache}/pip-src"

echo "== pip apply =="

# Bootstrap Guix pip if broken (24.x has resolvelib bug)
GUIX_PYTHON="$HOME/.guix-extra-profiles/core/core/bin/python3"
if [ -x "$GUIX_PYTHON" ]; then
  GUIX_PIP_VER=$("$GUIX_PYTHON" -m pip --version 2>/dev/null | awk '{print $2}' || echo "0")
  GUIX_PIP_MAJOR=$(echo "$GUIX_PIP_VER" | cut -d. -f1)
  if [ "${GUIX_PIP_MAJOR:-0}" -lt 25 ] 2>/dev/null; then
    echo "  bootstrapping pip (Guix pip $GUIX_PIP_VER is broken)..."
    curl -sS https://bootstrap.pypa.io/get-pip.py | "$GUIX_PYTHON" - --user \
      && echo "  pip bootstrapped to 26+" \
      || echo "  WARNING: get-pip.py failed"
  fi
fi

while IFS= read -r line; do
  # Skip comments and blanks
  [[ "$line" =~ ^[[:space:]]*# ]] && continue
  [[ -z "${line// /}" ]] && continue

  pkg="$(echo "$line" | awk '{ print $1 }')"
  version="$(echo "$line" | awk '{ print $2 }' | tr -d '"')"
  extra="$(echo "$line" | awk '{ print $3 }' | tr -d '"')"

  [ -z "$pkg" ] && continue

  # Git-sourced package: clone once, pull on subsequent runs, reinstall only on update
  if [[ "$extra" == git+https://* ]] || [[ "$extra" == git+http://* ]]; then
    cache="$SRC_CACHE/$pkg"
    clone_url="${extra#git+}"
    needs_install=0

    if [ ! -d "$cache/.git" ]; then
      echo "  cloning: $pkg → $cache"
      mkdir -p "$SRC_CACHE"
      git clone "$clone_url" "$cache"
      needs_install=1
    else
      before="$(git -C "$cache" rev-parse HEAD)"
      git -C "$cache" pull --ff-only --quiet
      after="$(git -C "$cache" rev-parse HEAD)"
      if [ "$before" != "$after" ]; then
        echo "  updated: $pkg ($before → $after)"
        needs_install=1
      fi
    fi

    if [ "$needs_install" = "1" ] || ! python3 -m pip show "$pkg" &>/dev/null; then
      echo "  installing: $pkg from $cache"
      python3 -m pip install --user --break-system-packages "$cache"
    else
      echo "  ok: $pkg"
    fi
    continue
  fi

  spec="$pkg"
  [ -n "$version" ] && spec="$pkg==$version"
  [ -n "$extra" ] && spec="$extra"

  if python3 -m pip show "$pkg" &>/dev/null; then
    echo "  ok: $pkg"
  else
    echo "  installing: $spec"
    python3 -m pip install --user --break-system-packages "$spec"
  fi
done <"$MAN"

echo "Done."
# Apply manifest:1 ends here
