all/.local/bin/pip-capture
#!/usr/bin/env bash
# Capture current pip → manifest

# [[file:../../../pip.org::*Capture current pip → manifest][Capture current pip → manifest:1]]
# ~/DotCortex/all/.local/bin/pip-capture
set -euo pipefail

MAN="$HOME/DotCortex/all/.pip/manifest/packages.ssv"

mkdir -p "$(dirname "$MAN")"
touch "$MAN"

tmp_existing="$(mktemp)"
tmp_have="$(mktemp)"
tmp_new="$(mktemp)"

# Already tracked
awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_existing"

# Currently installed (user + system, skip pip/setuptools/wheel)
/usr/bin/python3 -m pip list --format=freeze 2>/dev/null \
  | awk -F== '{ print $1 }' \
  | grep -vEi '^(pip|setuptools|wheel|pkg.resources)$' \
  | sort -u >"$tmp_have"

# new = have - existing
comm -13 "$tmp_existing" "$tmp_have" >"$tmp_new"

rm -f "$tmp_existing" "$tmp_have"

if [ ! -s "$tmp_new" ]; then
  rm -f "$tmp_new"
  echo "No new pip packages to capture into $MAN"
  exit 0
fi

while read -r pkg; do
  [ -n "$pkg" ] || continue
  printf '%s "" ""\n' "$pkg" >>"$MAN"
done <"$tmp_new"

rm -f "$tmp_new"
echo "Updated $MAN"
# Capture current pip → manifest:1 ends here
