all/.local/bin/pip-diff
#!/usr/bin/env bash
# Plan diff

# [[file:../../../pip.org::*Plan diff][Plan diff:1]]
# ~/DotCortex/all/.local/bin/pip-diff
set -euo pipefail

MAN="$HOME/DotCortex/all/.pip/manifest/packages.ssv"

tmp_want="$(mktemp)"
tmp_have="$(mktemp)"

awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | sort -u >"$tmp_want"

/usr/bin/python3 -m pip list --format=freeze 2>/dev/null \
  | awk -F== '{ print $1 }' \
  | sort -u >"$tmp_have"

echo "== pip plan =="
echo "[to install]"
comm -23 "$tmp_want" "$tmp_have" | sed 's/^/  + /'

echo "[extra - not in manifest]"
comm -13 "$tmp_want" "$tmp_have" \
  | grep -vEi '^(pip|setuptools|wheel|pkg.resources)$' \
  | sed 's/^/  - /'

rm -f "$tmp_want" "$tmp_have"
# Plan diff:1 ends here
